app/controllers/user/hostels_controller.rb

SELECT "hostels".* FROM "hostels" WHERE "hostels"."user_id" = $1  [["user_id", 1]]
---
    def index
      @hostels = Hostel.where(user_id: current_user.id)

SELECT  "hostels".* FROM "hostels" WHERE "hostels"."user_id" = $1 AND "hostels"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def show
      @hostel = current_user.hostels.find_by_id(params[:id])

INSERT INTO "hostels" ("description", "user_id", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "sixth"], ["user_id", 1], ["created_at", "2020-02-06 16:36:52.176463"], ["updated_at", "2020-02-06 16:36:52.176463"], ["name", "Sixth"]]
---
    def create
      @hostel = current_user.hostels.new(hostel_params)
      if @hostel.save

SELECT  "hostels".* FROM "hostels" WHERE "hostels"."user_id" = $1 AND "hostels"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def edit
      @hostel = current_user.hostels.find_by_id(params[:id])

SELECT  "hostels".* FROM "hostels" WHERE "hostels"."user_id" = $1 AND "hostels"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
UPDATE "hostels" SET "avatar" = $1, "updated_at" = $2 WHERE "hostels"."id" = $3  [["avatar", "72397697_745714539235003_7964037304484274799_n.jpg"], ["updated_at", "2020-02-06 16:40:33.736435"], ["id", 6]]
---
    def update
      @hostel = current_user.hostels.find_by_id(params[:id])
      if @hostel.update_attributes(hostel_params)