app/controllers/pages_controller.rb

  def hostel
    @hostels = Hostel.all
---
SELECT "hostels".* FROM "hostels"

  def show
    @hostel = Hostel.find_by_id(params[:id])
---
SELECT  "hostels".* FROM "hostels" WHERE "hostels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]